tests/apachebench/ab-1000-c50.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        nginx
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.3,TLS_AES_256_GCM_SHA384,2048,256
Server Temp Key:        X25519 253 bits
TLS Server Name:        localhost

Document Path:          /
Document Length:        2118 bytes

Concurrency Level:      50
Time taken for tests:   0.535 seconds
Complete requests:      1000
Failed requests:        974
   (Connect: 0, Receive: 0, Length: 974, Exceptions: 0)
Non-2xx responses:      974
Total transferred:      739218 bytes
HTML transferred:       240128 bytes
Requests per second:    1870.54 [#/sec] (mean)
Time per request:       26.730 [ms] (mean)
Time per request:       0.535 [ms] (mean, across all concurrent requests)
Transfer rate:          1350.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        2   14   4.3     13      29
Processing:     3   12   5.7     11      52
Waiting:        1   10   6.0     10      51
Total:          6   26   7.5     26      66

Percentage of the requests served within a certain time (ms)
  50%     26
  66%     28
  75%     30
  80%     31
  90%     34
  95%     41
  98%     47
  99%     52
 100%     66 (longest request)